
$(document).ready(function () {


  $('.ico-favorite2').click(function () {

    var that = this;

    $(this).toggleClass('-active');

    $.ajax({
      url: $(this).data('api-url'),
      dataType: 'json',
      data: {element_id : $(this).data('element-id')},
      success: function (data) {

        $(that).toggleClass('-active', data == "1");

      },
      error: function () {

        $(that).removeClass('-active');
      }
    });


  });


  $('.event-rating select').each(function () {

    $(this).barrating({
      theme: 'fa-stars-gold2',
      initialRating: $(this).data('current-rating'),
      readonly: true,
      allowEmpty: true,
      emptyValue: 0,
    });

  });


  $('.ee-search-block-2 .last-queries span').click(function () {

    $('.ee-search-block-2 .form-text').val($(this).text());

  });

  $('.ee-search-block-2 .last-queries .expand-toggle').click(function () {

    $(this).parent().addClass('-expanded');

  });

  $('.js-swipe-left').click(function () {

    $(this).parent().addClass('-active');

  });

  $('.js-swipe-right').click(function () {

    $(this).closest('.event-swipe-block').removeClass('-active');

  });


  $('.ee-about-block .expand-text-button-wrapper button').click(function () {

    $(this).parent().hide().prev().slideDown();



  });






  ////////////////////////


  var $filtersForm = $('#events-list-filters form');


  var $specWindow = $('.filter-window.-spec');
  var $specWindowToggle = $('.filter-column.-spec .filter-toggle span');

  var specTmpValues = [];

  $specWindowToggle.click(function () {

    if ($(this).hasClass('-active')) {

      specWindowClose();

    } else {

      specWindowOpen();

    }


  });

  $specWindow.find('.button-close').click(specWindowClose);

  $specWindow.find('.window-actions button').click(specWindowApply);

  $specWindow.find('.-select-all').change(function () {

    $specWindow.find('input[type=checkbox]').prop('checked', $(this).prop('checked'));


  });

  function specWindowOpen() {


    closeAll();

    /*
    specTmpValues = [];

    $specWindow.find('input:checked').each(function () {

      specTmpValues.push($(this).val());

    });


     */


    $specWindowToggle.addClass('-active');
    $specWindow.show();

  }

  function specWindowClose() {

    /*

    $specWindow.find('input[type=checkbox]').prop('checked', false);

    for (var i = 0;i<specTmpValues.length;i++) {

      $specWindow.find('input[value='+specTmpValues[i]+']').prop('checked', true);
    }


     */

    $specWindowToggle.removeClass('-active');
    $specWindow.hide();



  }

  function specWindowApply() {

    //$filtersForm.submit();


  }


  ////////

  var $typeWindow = $('.filter-window.-type');
  var $typeWindowToggle = $('.filter-column.-type .filter-toggle span');

  var typeTmpValues = [];

  $typeWindowToggle.click(function () {

    if ($(this).hasClass('-active')) {

      typeWindowClose();

    } else {

      typeWindowOpen();

    }


  });

  $typeWindow.find('.button-close').click(typeWindowClose);

  $typeWindow.find('.window-actions button').click(typeWindowApply);

  $typeWindow.find('.-select-all').change(function () {

    $typeWindow.find('input[type=checkbox]').prop('checked', $(this).prop('checked'));


  });

  function typeWindowOpen() {


    closeAll();

    typeTmpValues = [];

    $typeWindow.find('input:checked').each(function () {

      typeTmpValues.push($(this).val());

    });



    $typeWindowToggle.addClass('-active');
    $typeWindow.show();

  }

  function typeWindowClose() {

    $typeWindow.find('input[type=checkbox]').prop('checked', false);

    for (var i = 0;i<typeTmpValues.length;i++) {

      $typeWindow.find('input[value='+typeTmpValues[i]+']').prop('checked', true);
    }

    $typeWindowToggle.removeClass('-active');
    $typeWindow.hide();

  }

  function typeWindowApply() {

    //$filtersForm.submit();


  }


  ////////////

  var $geoWindow = $('.filter-window.-geo');
  var $geoWindowToggle = $('.filter-column.-country .filter-toggle span, .filter-column.-region .filter-toggle span, .filter-column.-city .filter-toggle span');
  var $geoList = $geoWindow.find('.geo-select-list');



  $geoWindowToggle.click(function () {

    if ($geoWindow.is(':visible')) {

      geoWindowClose();

    } else {

      geoWindowOpen();

    }


  });
  $geoWindow.find('.button-close').click(geoWindowClose);

  $geoList.on('click', 'button.-del', function () {

    var $rowItem = $(this).parent().parent();

    if ($rowItem.index() > 0) { $rowItem.remove(); }

  });

  $geoList.on('click', 'button.-add', function () {

    var $rowItem = $(this).parent().parent();

    var $newRowItem = $rowItem.clone().appendTo($geoList);

    $newRowItem.find('select').each(function () {

      $(this).attr('name', $(this).attr('name').replace(/\[\d+\]/, '[' + ($newRowItem.index() + 1) + ']'));

    });

    //alert($newRowItem.index());


  });

  $geoList.on('change', 'select.-country', function () {

    var $regionSelect = $(this).parent().parent().find('select.-region');
    var $citySelect = $(this).parent().parent().find('select.-city');

    $.getJSON($geoList.data('regions-api-url'), {id: $(this).val()}, function (data) {

      $citySelect.find('option').not(':first-child').remove();
      $regionSelect.find('option').not(':first-child').remove();

      for (var i=0;i<data.length;i++) {

        $regionSelect.append('<option value="'+data[i].id+'">'+data[i].title+'</option>');

      }

    });



  });

  $geoList.on('change', 'select.-region', function () {

    var $citySelect = $(this).parent().parent().find('select.-city');

    $.getJSON($geoList.data('cities-api-url'), {id: $(this).val()}, function (data) {

      $citySelect.find('option').not(':first-child').remove();

      for (var i=0;i<data.length;i++) {

        $citySelect.append('<option value="'+data[i].id+'">'+data[i].title+'</option>');

      }

    });



  });


  function geoWindowOpen() {

    closeAll();

    $geoList.find('select.-country').eq(0).attr('name', 'country[1]');
    $geoList.find('select.-region').eq(0).attr('name', 'region[1]');
    $geoList.find('select.-city').eq(0).attr('name', 'city[1]');


    $geoList.find('select.-country').eq(0).trigger('change');

    $geoWindowToggle.addClass('-active');
    $geoWindow.show();

  }

  function geoWindowClose() {

    $geoList.find('.list-item').not(':first-child').remove();

    $geoList.find('select').attr('name', '');

    $geoWindowToggle.removeClass('-active');
    $geoWindow.hide();

  }


  ///////////////////////

  var $dateWindow = $('.filter-window.-date');
  var $dateWindowToggle = $('.filter-column.-date .filter-toggle span');

  var $datepickerFrom = $('#datepicker-from');
  var $datepickerTo = $('#datepicker-to');

  var tmpDateFrom = $('#date-from').val();
  var tmpDateTo = $('#date-to').val();

  var initDateFrom;
  var initDateTo;

  function strToDate(str) {

    if (str) {
      str = str.split(', ')[1].split('.');

      return new Date(parseInt(str[2]), parseInt(str[1]) - 1, parseInt(str[0]));
    } else {

      return new Date();
    }

  }

  function dateWindowOpen() {

    closeAll();

    var tzoffset = (new Date()).getTimezoneOffset() * 60000;

    var dates = getHolidays();

    var highlightDays = JSON.parse($('#highlighted-days').val());

    $datepickerFrom.datepicker({
      showOtherMonths: true,
      dateFormat: "D, dd.mm.yy",
      onSelect: function (dateText, inst) {

        updateDateControls(inst);


        updateRange($datepickerFrom.datepicker('getDate'), $datepickerTo.datepicker('getDate'));

        $(inst.input).datepicker('refresh');

      },
      beforeShowDay: function (date){

          var classes = '';
          var title = '';

          var highlightDay = findHighlightDay(new Date(date - tzoffset).toISOString().slice(0, 10), highlightDays);

          if (highlightDay) {

            classes+= 'ui-state-highlighted-' + highlightDay.color;
            title = highlightDay.caption;

          }


        if (date <= $datepickerTo.datepicker('getDate') && date >= $datepickerFrom.datepicker('getDate')) {

            classes+= ' ui-state-range';

        }

        var year = date.getFullYear(), month = date.getMonth(), day = date.getDate();

        // see if the current date should be highlighted
        for (var i=0; i < dates.length; ++i)
          if (year == dates[i][0] && month == dates[i][1] - 1 &&  day == dates[i][2])
            return [true, classes + ' ui-datepicker-week-end'];

        return [true, classes, title];
      }
    });



    $datepickerTo.datepicker({
      showOtherMonths: true,
      dateFormat: "D, dd.mm.yy",
      onSelect: function (dateText, inst) {

        updateDateControls(inst);
        updateRange($datepickerFrom.datepicker('getDate'), $datepickerTo.datepicker('getDate'));

      },
      beforeShowDay: function (date){

          var classes = '';
          var title = '';

          var highlightDay = findHighlightDay(new Date(date - tzoffset).toISOString().slice(0, 10), highlightDays);

          if (highlightDay) {

              classes+= 'ui-state-highlighted-' + highlightDay.color;
              title = highlightDay.caption;

          }

        if (date <= $datepickerTo.datepicker('getDate') && date >= $datepickerFrom.datepicker('getDate')) {

            classes+= ' ui-state-range';

        }

        var year = date.getFullYear(), month = date.getMonth(), day = date.getDate();

        // see if the current date should be highlighted
        for (var i=0; i < dates.length; ++i)
          if (year == dates[i][0] && month == dates[i][1] - 1 &&  day == dates[i][2])
              return [true, classes + ' ui-datepicker-week-end'];

          return [true, classes, title];
      }
    });

    initDateFrom = strToDate($('#date-from').val());



    if ($('#date-to').val()) {

      initDateTo = strToDate($('#date-to').val());

    } else {

      initDateTo = new Date();
      initDateTo.setMonth(initDateTo.getMonth() +1);
    }


    $datepickerFrom.datepicker("setDate", initDateFrom);
    $datepickerTo.datepicker("setDate", initDateTo);

    updateDateControls($.datepicker._getInst($datepickerFrom[0]));
    updateDateControls($.datepicker._getInst($datepickerTo[0]));

    updateRange(initDateFrom, initDateTo);


    $dateWindowToggle.addClass('-active');
    $dateWindow.show();

  }

  function findHighlightDay(day, highlightDays) {

      if (!highlightDays) return false;


      var result = false;


      $.each(highlightDays, function () {



          if (day === this.day) {

              result = this;

              return false;
          }

      });

      return result;

  }

  function dateWindowClose() {

    $('#date-from').val(tmpDateFrom);
    $('#date-to').val(tmpDateTo);

    $dateWindowToggle.removeClass('-active');
    $dateWindow.hide();

  }

  $dateWindowToggle.click(function () {

    if ($dateWindow.is(':visible')) {

      dateWindowClose();

    } else {

      dateWindowOpen();

    }


  });
  $dateWindow.find('.button-close').click(dateWindowClose);

  $('.date-from-wrapper .calendar-controls i').click(function () {

    dateIncDec($(this), $('#datepicker-from'));

  });

  $('.date-to-wrapper .calendar-controls i').click(function () {

    dateIncDec($(this), $('#datepicker-to'));

  });

  //$('#month-left-from').click(function () {$datepickerFrom.find('.ui-datepicker-prev').trigger('click');});
  //$('#month-right-from').click(function () {$datepickerFrom.find('.ui-datepicker-next').trigger('click');});

  function dateIncDec($element, $datepicker) {

    var date = $datepicker.datepicker("getDate");

    var $parent = $element.parent();

    if ($parent.hasClass('control-day')) {

      date.setDate(date.getDate() + ($element.is(':first-child') ? -1 : 1));

    }

    if ($parent.hasClass('control-month')) {

      date.setMonth(date.getMonth() + ($element.is(':first-child') ? -1 : 1));

    }

    if ($parent.hasClass('control-year')) {

      date.setFullYear(date.getFullYear() + ($element.is(':first-child') ? -1 : 1));

    }


    $datepicker.datepicker("setDate", date);

    updateDateControls($.datepicker._getInst($datepicker[0]));


  }

  function updateDateControls(inst) {

    var $controls = $(inst.input[0]).prev();

    var $input = $(inst.input[0]).parent().parent().find('.date-input input');

    $input.val($.datepicker.formatDate("D, dd.mm.yy", new Date( inst.currentYear, inst.currentMonth, inst.currentDay )));



    $controls.find('.control-day span').text(inst.currentDay);
    $controls.find('.control-month span').text($.datepicker.formatDate("MM", new Date( inst.currentYear, inst.currentMonth )));
    $controls.find('.control-year span').text(inst.currentYear);


  }

  function updateRange(from, to) {



    $('.ui-datepicker-calendar td').each(function () {

      var tdDate = new Date($(this).data('year'), $(this).data('month'), $(this).text());

      if (tdDate.valueOf() >= from.valueOf() && tdDate.valueOf() <= to.valueOf()) {

        $(this).addClass('ui-state-range');
      }




    });

    $datepickerFrom.datepicker('option', 'maxDate', $datepickerTo.datepicker('getDate'));
    $datepickerTo.datepicker('option', 'minDate', $datepickerFrom.datepicker('getDate'));

  }

  $('#date-select-reset').click(function () {

    $datepickerFrom.datepicker("setDate", initDateFrom);
    $datepickerTo.datepicker("setDate", initDateTo);

    updateDateControls($.datepicker._getInst($datepickerFrom[0]));
    updateDateControls($.datepicker._getInst($datepickerTo[0]));

  });


  ///////////////////


  function closeAll() {

    specWindowClose();
    geoWindowClose();
    typeWindowClose();
    dateWindowClose();

  }


  $('.filter-toggle span').click(function () {

    if ($(this).hasClass('-active')) {

      $('.filter-items').hide();

    } else {
      $('.filter-items').show();
    }



  });

  $('.filter-window .button-close').click(function () {

    $('.filter-items').show();

  });

  $('.filter-item.-expand-control').click(function () {

    if ($(this).find('.fa-angle-down').length) {

      $(this).find('i').removeClass('fa-angle-down').addClass('fa-angle-up');
      $(this).find('span').text('Свернуть');

      $('.filter-item').show();


    } else  {

      $(this).find('i').removeClass('fa-angle-up').addClass('fa-angle-down');
      $(this).find('span').text('Все выбранные');

      $('.filter-item').each(function () {

        if ($(this).index() > 2) {

          $(this).hide()

        }

      });

    }

  });


});


( function( factory ) {
  if ( typeof define === "function" && define.amd ) {

    // AMD. Register as an anonymous module.
    define( [ "../widgets/datepicker" ], factory );
  } else {

    // Browser globals
    factory( jQuery.datepicker );
  }
}( function( datepicker ) {

  datepicker.regional.ru = {
    closeText: "Закрыть",
    prevText: "&#x3C;Пред",
    nextText: "След&#x3E;",
    currentText: "Сегодня",
    monthNames: [ "Январь","Февраль","Март","Апрель","Май","Июнь",
      "Июль","Август","Сентябрь","Октябрь","Ноябрь","Декабрь" ],
    monthNamesShort: [ "Янв","Фев","Мар","Апр","Май","Июн",
      "Июл","Авг","Сен","Окт","Ноя","Дек" ],
    dayNames: [ "воскресенье","понедельник","вторник","среда","четверг","пятница","суббота" ],
    dayNamesShort: [ "Вс","Пн","Вт","Ср","Чт","Пт","Сб" ],
    dayNamesMin: [ "Вс","Пн","Вт","Ср","Чт","Пт","Сб" ],
    weekHeader: "Нед",
    dateFormat: "dd.mm.yy",
    firstDay: 1,
    isRTL: false,
    showMonthAfterYear: false,
    yearSuffix: "" };
  datepicker.setDefaults( datepicker.regional.ru );

  return datepicker.regional.ru;

} ) );


function getHolidays() {

  var holidays = [
    {
      "Год/Месяц": 1999,
      "Январь": "1,2,3,4,6*,7,9,10,16,17,23,24,30,31",
      "Февраль": "6,7,13,14,20,21,27,28",
      "Март": "6,7,8,13,14,20,21,27,28",
      "Апрель": "3,4,10,11,17,18,24,25,30*",
      "Май": "1,2,3,4,8,9,10,15,16,22,23,29,30",
      "Июнь": "5,6,11*,12,13,14,19,20,26,27",
      "Июль": "3,4,10,11,17,18,24,25,31",
      "Август": "1,7,8,14,15,21,22,28,29",
      "Сентябрь": "4,5,11,12,18,19,25,26",
      "Октябрь": "2,3,9,10,16,17,23,24,30,31",
      "Ноябрь": "6,7,8,13,14,20,21,27,28",
      "Декабрь": "4,5,11,12,13,18,19,25,26,31*",
      "Всего рабочих дней": 251,
      "Всего праздничных и выходных дней": 114,
      "Количество рабочих часов при 40-часовой рабочей неделе": 2004,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1807.2,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1204.8
    },
    {
      "Год/Месяц": 2000,
      "Январь": "1,2,3,4,6*,7,8,9,15,16,22,23,29,30",
      "Февраль": "5,6,12,13,19,20,26,27",
      "Март": "4,5,7*,8,11,12,18,19,25,26",
      "Апрель": "1,2,8,9,15,16,22,23,29,30",
      "Май": "1,2,6,7,8*,9,13,14,20,21,27,28",
      "Июнь": "3,4,10,11,12,17,18,24,25",
      "Июль": "1,2,8,9,15,16,22,23,29,30",
      "Август": "5,6,12,13,19,20,26,27",
      "Сентябрь": "2,3,9,10,16,17,23,24,30",
      "Октябрь": "1,7,8,14,15,21,22,28,29",
      "Ноябрь": "4,5,7,11,12,18,19,25,26",
      "Декабрь": "2,3,9,10,11*,12,16,17,23,24,30,31",
      "Всего рабочих дней": 250,
      "Всего праздничных и выходных дней": 116,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1995,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1800,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1200
    },
    {
      "Год/Месяц": 2001,
      "Январь": "1,2,6,7,8,13,14,20,21,27,28",
      "Февраль": "3,4,10,11,17,18,24,25",
      "Март": "3,4,7*,8,10,11,17,18,24,25,31",
      "Апрель": "1,7,8,14,15,21,22,28,29,30*",
      "Май": "1,2,5,6,8*,9,12,13,19,20,26,27",
      "Июнь": "2,3,9,10,11*,12,16,17,23,24,30",
      "Июль": "1,7,8,14,15,21,22,28,29",
      "Август": "4,5,11,12,18,19,25,26",
      "Сентябрь": "1,2,8,9,15,16,22,23,29,30",
      "Октябрь": "6,7,13,14,20,21,27,28",
      "Ноябрь": "3,4,6*,7,10,11,17,18,24,25",
      "Декабрь": "1,2,8,9,12,15,16,22,23,29,30",
      "Всего рабочих дней": 251,
      "Всего праздничных и выходных дней": 114,
      "Количество рабочих часов при 40-часовой рабочей неделе": 2001,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1807.2,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1204.8
    },
    {
      "Год/Месяц": 2002,
      "Январь": "1,2,5,6,7,12,13,19,20,26,27",
      "Февраль": "2,3,9,10,16,17,22*,23,24,25",
      "Март": "2,3,7*,8,9,10,16,17,23,24,30,31",
      "Апрель": "6,7,13,14,20,21,28,30*",
      "Май": "1,2,3,4,5,8*,9,10,11,12,19,25,26",
      "Июнь": "1,2,8,9,11*,12,15,16,22,23,29,30",
      "Июль": "6,7,13,14,20,21,27,28",
      "Август": "3,4,10,11,17,18,24,25,31",
      "Сентябрь": "1,7,8,14,15,21,22,28,29",
      "Октябрь": "5,6,12,13,19,20,26,27",
      "Ноябрь": "2,3,6*,7,8,9,16,17,23,24,30",
      "Декабрь": "1,7,8,11*,12,13,14,21,22,28,29,31*",
      "Всего рабочих дней": 250,
      "Всего праздничных и выходных дней": 115,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1992,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1792,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1192
    },
    {
      "Год/Месяц": 2003,
      "Январь": "1,2,3,5*,6,7,11,12,18,19,25,26",
      "Февраль": "1,2,8,9,15,16,22,23,24",
      "Март": "1,2,7*,8,9,10,15,16,22,23,29,30",
      "Апрель": "5,6,12,13,19,20,26,27,30*",
      "Май": "1,2,3,4,8*,9,10,11,17,18,24,25,31",
      "Июнь": "1,7,8,11*,12,13,14,15,22,28,29",
      "Июль": "5,6,12,13,19,20,26,27",
      "Август": "2,3,9,10,16,17,23,24,30,31",
      "Сентябрь": "6,7,13,14,20,21,27,28",
      "Октябрь": "4,5,11,12,18,19,25,26",
      "Ноябрь": "1,2,6*,7,8,9,15,16,22,23,29,30",
      "Декабрь": "6,7,11*,12,13,14,20,21,27,28,31*",
      "Всего рабочих дней": 250,
      "Всего праздничных и выходных дней": 115,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1992,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1792,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1192
    },
    {
      "Год/Месяц": 2004,
      "Январь": "1,2,3,4,6*,7,10,11,17,18,24,25,31",
      "Февраль": "1,7,8,14,15,21,22,23,28,29",
      "Март": "6,7,8,13,14,20,21,27,28",
      "Апрель": "3,4,10,11,17,18,24,25,30*",
      "Май": "1,2,3,4,8,9,10,15,16,22,23,29,30",
      "Июнь": "5,6,11*,12,13,14,19,20,26,27",
      "Июль": "3,4,10,11,17,18,24,25,31",
      "Август": "1,7,8,14,15,21,22,28,29",
      "Сентябрь": "4,5,11,12,18,19,25,26",
      "Октябрь": "2,3,9,10,16,17,23,24,30,31",
      "Ноябрь": "6,7,8,13,14,20,21,27,28",
      "Декабрь": "4,5,11,12,13,18,19,25,26,31*",
      "Всего рабочих дней": 251,
      "Всего праздничных и выходных дней": 115,
      "Количество рабочих часов при 40-часовой рабочей неделе": 2004,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1803.2,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1200.8
    },
    {
      "Год/Месяц": 2005,
      "Январь": "1,2,3,4,5,6,7,8,9,10,15,16,22,23,29,30",
      "Февраль": "5,6,12,13,19,20,22*,23,26,27",
      "Март": "5*,6,7,8,12,13,19,20,26,27",
      "Апрель": "2,3,9,10,16,17,23,24,30",
      "Май": "1,2,7,8,9,14,15,21,22,28,29",
      "Июнь": "4,5,11,12,13,18,19,25,26",
      "Июль": "2,3,9,10,16,17,23,24,30,31",
      "Август": "6,7,13,14,20,21,27,28",
      "Сентябрь": "3,4,10,11,17,18,24,25",
      "Октябрь": "1,2,8,9,15,16,22,23,29,30",
      "Ноябрь": "3*,4,5,6,12,13,19,20,26,27",
      "Декабрь": "3,4,10,11,17,18,24,25,31",
      "Всего рабочих дней": 248,
      "Всего праздничных и выходных дней": 117,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1981,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1782.6,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1187.4
    },
    {
      "Год/Месяц": 2006,
      "Январь": "1,2,3,4,5,6,7,8,9,14,15,21,22,28,29",
      "Февраль": "4,5,11,12,18,19,22*,23,24,25",
      "Март": "4,5,7*,8,11,12,18,19,25,26",
      "Апрель": "1,2,8,9,15,16,22,23,29,30",
      "Май": "1,6*,7,8,9,13,14,20,21,27,28",
      "Июнь": "3,4,10,11,12,17,18,24,25",
      "Июль": "1,2,8,9,15,16,22,23,29,30",
      "Август": "5,6,12,13,19,20,26,27",
      "Сентябрь": "2,3,9,10,16,17,23,24,30",
      "Октябрь": "1,7,8,14,15,21,22,28,29",
      "Ноябрь": "3*,4,5,6,11,12,18,19,25,26",
      "Декабрь": "2,3,9,10,16,17,23,24,30,31",
      "Всего рабочих дней": 248,
      "Всего праздничных и выходных дней": 117,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1981,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1782.6,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1187.4
    },
    {
      "Год/Месяц": 2007,
      "Январь": "1,2,3,4,5,6,7,8,13,14,20,21,27,28",
      "Февраль": "3,4,10,11,17,18,22*,23,24,25",
      "Март": "3,4,7*,8,10,11,17,18,24,25,31",
      "Апрель": "1,7,8,14,15,21,22,28*,29,30",
      "Май": "1,5,6,8*,9,12,13,19,20,26,27",
      "Июнь": "2,3,9*,10,11,12,16,17,23,24,30",
      "Июль": "1,7,8,14,15,21,22,28,29",
      "Август": "4,5,11,12,18,19,25,26",
      "Сентябрь": "1,2,8,9,15,16,22,23,29,30",
      "Октябрь": "6,7,13,14,20,21,27,28",
      "Ноябрь": "3,4,5,10,11,17,18,24,25",
      "Декабрь": "1,2,8,9,15,16,22,23,29*,30,31",
      "Всего рабочих дней": 249,
      "Всего праздничных и выходных дней": 116,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1986,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1786.8,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1189.2
    },
    {
      "Год/Месяц": 2008,
      "Январь": "1,2,3,4,5,6,7,8,12,13,19,20,26,27",
      "Февраль": "2,3,9,10,16,17,22*,23,24,25",
      "Март": "1,2,7*,8,9,10,15,16,22,23,29,30",
      "Апрель": "5,6,12,13,19,20,26,27,30*",
      "Май": "1,2,3,8*,9,10,11,17,18,24,25,31",
      "Июнь": "1,8,11*,12,13,14,15,21,22,28,29",
      "Июль": "5,6,12,13,19,20,26,27",
      "Август": "2,3,9,10,16,17,23,24,30,31",
      "Сентябрь": "6,7,13,14,20,21,27,28",
      "Октябрь": "4,5,11,12,18,19,25,26",
      "Ноябрь": "1*,2,3,4,8,9,15,16,22,23,29,30",
      "Декабрь": "6,7,13,14,20,21,27,28,31*",
      "Всего рабочих дней": 250,
      "Всего праздничных и выходных дней": 116,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1993,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1793,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1193
    },
    {
      "Год/Месяц": 2009,
      "Январь": "1,2,3,4,5,6,7,8,9,10,17,18,24,25,31",
      "Февраль": "1,7,8,14,15,21,22,23,28",
      "Март": "1,7,8,9,14,15,21,22,28,29",
      "Апрель": "4,5,11,12,18,19,25,26",
      "Май": "1,2,3,8*,9,10,11,16,17,23,24,30,31",
      "Июнь": "6,7,11*,12,13,14,20,21,27,28",
      "Июль": "4,5,11,12,18,19,25,26",
      "Август": "1,2,8,9,15,16,22,23,29,30",
      "Сентябрь": "5,6,12,13,19,20,26,27",
      "Октябрь": "3,4,10,11,17,18,24,25,31",
      "Ноябрь": "1,3*,4,7,8,14,15,21,22,28,29",
      "Декабрь": "5,6,12,13,19,20,26,27,31*",
      "Всего рабочих дней": 249,
      "Всего праздничных и выходных дней": 116,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1987,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1787.8,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1190.2
    },
    {
      "Год/Месяц": 2010,
      "Январь": "1,2,3,4,5,6,7,8,9,10,16,17,23,24,30,31",
      "Февраль": "6,7,13,14,20,21,22,23,27*,28",
      "Март": "6,7,8,13,14,20,21,27,28",
      "Апрель": "3,4,10,11,17,18,24,25,30*",
      "Май": "1,2,3,8,9,10,15,16,22,23,29,30",
      "Июнь": "5,6,11*,12,13,14,19,20,26,27",
      "Июль": "3,4,10,11,17,18,24,25,31",
      "Август": "1,7,8,14,15,21,22,28,29",
      "Сентябрь": "4,5,11,12,18,19,25,26",
      "Октябрь": "2,3,9,10,16,17,23,24,30,31",
      "Ноябрь": "3*,4,5,6,7,14,20,21,27,28",
      "Декабрь": "4,5,11,12,18,19,25,26,31*",
      "Всего рабочих дней": 249,
      "Всего праздничных и выходных дней": 116,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1987,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1787.8,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1190.2
    },
    {
      "Год/Месяц": 2011,
      "Январь": "1,2,3,4,5,6,7,8,9,10,15,16,22,23,29,30",
      "Февраль": "5,6,12,13,19,20,22*,23,26,27",
      "Март": "5*,6,7,8,12,13,19,20,26,27",
      "Апрель": "2,3,9,10,16,17,23,24,30",
      "Май": "1,2,7,8,9,14,15,21,22,28,29",
      "Июнь": "4,5,11,12,13,18,19,25,26",
      "Июль": "2,3,9,10,16,17,23,24,30,31",
      "Август": "6,7,13,14,20,21,27,28",
      "Сентябрь": "3,4,10,11,17,18,24,25",
      "Октябрь": "1,2,8,9,15,16,22,23,29,30",
      "Ноябрь": "3*,4,5,6,12,13,19,20,26,27",
      "Декабрь": "3,4,10,11,17,18,24,25,31",
      "Всего рабочих дней": 248,
      "Всего праздничных и выходных дней": 117,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1981,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1782.6,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1187.4
    },
    {
      "Год/Месяц": 2012,
      "Январь": "1,2,3,4,5,6,7,8,9,14,15,21,22,28,29",
      "Февраль": "4,5,11,12,18,19,22*,23,25,26",
      "Март": "3,4,7*,8,9,10,17,18,24,25,31",
      "Апрель": "1,7,8,14,15,21,22,28*,29,30",
      "Май": "1,6,7,8,9,12*,13,19,20,26,27",
      "Июнь": "2,3,9*,10,11,12,16,17,23,24,30",
      "Июль": "1,7,8,14,15,21,22,28,29",
      "Август": "4,5,11,12,18,19,25,26",
      "Сентябрь": "1,2,8,9,15,16,22,23,29,30",
      "Октябрь": "6,7,13,14,20,21,27,28",
      "Ноябрь": "3,4,5,10,11,17,18,24,25",
      "Декабрь": "1,2,8,9,15,16,22,23,29*,30,31",
      "Всего рабочих дней": 249,
      "Всего праздничных и выходных дней": 117,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1986,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1786.8,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1189.2
    },
    {
      "Год/Месяц": 2013,
      "Январь": "1,2,3,4,5,6,7,8,12,13,19,20,26,27",
      "Февраль": "2,3,9,10,16,17,22*,23,24",
      "Март": "2,3,7*,8,9,10,16,17,23,24,30,31",
      "Апрель": "6,7,13,14,20,21,27,28",
      "Май": "1,2,3,4,5,8*,9,10,11,12,18,19,25,26",
      "Июнь": "1,2,8,9,11*,12,15,16,22,23,29,30",
      "Июль": "6,7,13,14,20,21,27,28",
      "Август": "3,4,10,11,17,18,24,25,31",
      "Сентябрь": "1,7,8,14,15,21,22,28,29",
      "Октябрь": "5,6,12,13,19,20,26,27",
      "Ноябрь": "2,3,4,9,10,16,17,23,24,30",
      "Декабрь": "1,7,8,14,15,21,22,28,29,31*",
      "Всего рабочих дней": 247,
      "Всего праздничных и выходных дней": 118,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1970,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1772.4,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1179.6
    },
    {
      "Год/Месяц": 2014,
      "Январь": "1,2,3,4,5,6,7,8,11,12,18,19,25,26",
      "Февраль": "1,2,8,9,15,16,22,23,24*",
      "Март": "1,2,7*,8,9,10,15,16,22,23,29,30",
      "Апрель": "5,6,12,13,19,20,26,27,30*",
      "Май": "1,2,3,4,8*,9,10,11,17,18,24,25,31",
      "Июнь": "1,7,8,11*,12,13,14,15,21,22,28,29",
      "Июль": "5,6,12,13,19,20,26,27",
      "Август": "2,3,9,10,16,17,23,24,30,31",
      "Сентябрь": "6,7,13,14,20,21,27,28",
      "Октябрь": "4,5,11,12,18,19,25,26",
      "Ноябрь": "1,2,3,4,8,9,15,16,22,23,29,30",
      "Декабрь": "6,7,13,14,20,21,27,28",
      "Всего рабочих дней": 247,
      "Всего праздничных и выходных дней": 118,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1970,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1772.4,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1179.6
    },
    {
      "Год/Месяц": 2015,
      "Январь": "1,2,3,4,5,6,7,8,9,10,11,17,18,24,25,31",
      "Февраль": "1,7,8,14,15,21,22,23,28",
      "Март": "1,7,8,9,14,15,21,22,28,29",
      "Апрель": "4,5,11,12,18,19,25,26,30*",
      "Май": "1,2,3,4,8*,9,10,11,16,17,23,24,30,31",
      "Июнь": "6,7,11*,12,13,14,20,21,27,28",
      "Июль": "4,5,11,12,18,19,25,26",
      "Август": "1,2,8,9,15,16,22,23,29,30",
      "Сентябрь": "5,6,12,13,19,20,26,27",
      "Октябрь": "3,4,10,11,17,18,24,25,31",
      "Ноябрь": "1,3*,4,7,8,14,15,21,22,28,29",
      "Декабрь": "5,6,12,13,19,20,26,27,31*",
      "Всего рабочих дней": 247,
      "Всего праздничных и выходных дней": 118,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1971,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1773.4,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1180.6
    },
    {
      "Год/Месяц": 2016,
      "Январь": "1,2,3,4,5,6,7,8,9,10,16,17,23,24,30,31",
      "Февраль": "6,7,13,14,20*,21,22,23,27,28",
      "Март": "5,6,7,8,12,13,19,20,26,27",
      "Апрель": "2,3,9,10,16,17,23,24,30",
      "Май": "1,2,3,7,8,9,14,15,21,22,28,29",
      "Июнь": "4,5,11,12,13,18,19,25,26",
      "Июль": "2,3,9,10,16,17,23,24,30,31",
      "Август": "6,7,13,14,20,21,27,28",
      "Сентябрь": "3,4,10,11,17,18,24,25",
      "Октябрь": "1,2,8,9,15,16,22,23,29,30",
      "Ноябрь": "3*,4,5,6,12,13,19,20,26,27",
      "Декабрь": "3,4,10,11,17,18,24,25,31",
      "Всего рабочих дней": 247,
      "Всего праздничных и выходных дней": 119,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1974,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1776.4,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1183.6
    },
    {
      "Год/Месяц": 2017,
      "Январь": "1,2,3,4,5,6,7,8,14,15,21,22,28,29",
      "Февраль": "4,5,11,12,18,19,22*,23,24,25,26",
      "Март": "4,5,7*,8,11,12,18,19,25,26",
      "Апрель": "1,2,8,9,15,16,22,23,29,30",
      "Май": "1,6,7,8,9,13,14,20,21,27,28",
      "Июнь": "3,4,10,11,12,17,18,24,25",
      "Июль": "1,2,8,9,15,16,22,23,29,30",
      "Август": "5,6,12,13,19,20,26,27",
      "Сентябрь": "2,3,9,10,16,17,23,24,30",
      "Октябрь": "1,7,8,14,15,21,22,28,29",
      "Ноябрь": "3*,4,5,6,11,12,18,19,25,26",
      "Декабрь": "2,3,9,10,16,17,23,24,30,31",
      "Всего рабочих дней": 247,
      "Всего праздничных и выходных дней": 118,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1973,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1775.4,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1182.6
    },
    {
      "Год/Месяц": 2018,
      "Январь": "1,2,3,4,5,6,7,8,13,14,20,21,27,28",
      "Февраль": "3,4,10,11,17,18,22*,23,24,25",
      "Март": "3,4,7*,8,9,10,11,17,18,24,25,31",
      "Апрель": "1,7,8,14,15,21,22,28*,29,30",
      "Май": "1,2,5,6,8*,9,12,13,19,20,26,27",
      "Июнь": "2,3,9*,10,11,12,16,17,23,24,30",
      "Июль": "1,7,8,14,15,21,22,28,29",
      "Август": "4,5,11,12,18,19,25,26",
      "Сентябрь": "1,2,8,9,15,16,22,23,29,30",
      "Октябрь": "6,7,13,14,20,21,27,28",
      "Ноябрь": "3,4,5,10,11,17,18,24,25",
      "Декабрь": "1,2,8,9,15,16,22,23,29*,30,31",
      "Всего рабочих дней": 247,
      "Всего праздничных и выходных дней": 118,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1970,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1772.4,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1179.6
    },
    {
      "Год/Месяц": 2019,
      "Январь": "1,2,3,4,5,6,7,8,12,13,19,20,26,27",
      "Февраль": "2,3,9,10,16,17,22*,23,24",
      "Март": "2,3,7*,8,9,10,16,17,23,24,30,31",
      "Апрель": "6,7,13,14,20,21,27,28,30*",
      "Май": "1,2,3,4,5,8*,9,10,11,12,18,19,25,26",
      "Июнь": "1,2,8,9,11*,12,15,16,22,23,29,30",
      "Июль": "6,7,13,14,20,21,27,28",
      "Август": "3,4,10,11,17,18,24,25,31",
      "Сентябрь": "1,7,8,14,15,21,22,28,29",
      "Октябрь": "5,6,12,13,19,20,26,27",
      "Ноябрь": "2,3,4,9,10,16,17,23,24,30",
      "Декабрь": "1,7,8,14,15,21,22,28,29,31*",
      "Всего рабочих дней": 247,
      "Всего праздничных и выходных дней": 118,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1970,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1772.4,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1179.6
    },
    {
      "Год/Месяц": 2020,
      "Январь": "1,2,3,4,5,6,7,8,11,12,18,19,25,26",
      "Февраль": "1,2,8,9,15,16,22,23,24+,29",
      "Март": "1,7,8,9+,14,15,21,22,28,29",
      "Апрель": "4,5,11,12,18,19,25,26,30*",
      "Май": "1,2,3,8*,9,10,11+,16,17,23,24,30,31",
      "Июнь": "6,7,11*,12,13,14,20,21,27,28",
      "Июль": "4,5,11,12,18,19,25,26",
      "Август": "1,2,8,9,15,16,22,23,29,30",
      "Сентябрь": "5,6,12,13,19,20,26,27",
      "Октябрь": "3,4,10,11,17,18,24,25,31",
      "Ноябрь": "1,3*,4,7,8,14,15,21,22,28,29",
      "Декабрь": "5,6,12,13,19,20,26,27,31*",
      "Всего рабочих дней": 250,
      "Всего праздничных и выходных дней": 116,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1995,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1795,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1195
    },
    {
      "Год/Месяц": 2021,
      "Январь": "1,2,3,4,5,6,7,8,9,10,16,17,23,24,30,31",
      "Февраль": "6,7,13,14,20,21,22*,23,27,28",
      "Март": "6,7,8*,13,14,20,21,27,28",
      "Апрель": "3,4,10,11,17,18,24,25,30*",
      "Май": "1,2,3+,8,9,10+,15,16,22,23,29,30",
      "Июнь": "5,6,11*,12,13,14+,19,20,26,27",
      "Июль": "3,4,10,11,17,18,24,25,31",
      "Август": "1,7,8,14,15,21,22,28,29",
      "Сентябрь": "4,5,11,12,18,19,25,26",
      "Октябрь": "2,3,9,10,16,17,23,24,30,31",
      "Ноябрь": "3*,4,6,7,13,14,20,21,27,28",
      "Декабрь": "4,5,11,12,18,19,25,26,31*",
      "Всего рабочих дней": 249,
      "Всего праздничных и выходных дней": 116,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1987,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1787.8,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1190.2
    },
    {
      "Год/Месяц": 2022,
      "Январь": "1,2,3,4,5,6,7,8,9,15,16,22,23,29,30",
      "Февраль": "5,6,12,13,19,20,22*,23,26,27",
      "Март": "5,6,7*,8,12,13,19,20,26,27",
      "Апрель": "2,3,9,10,16,17,23,24,30",
      "Май": "1,2+,7,8,9,14,15,21,22,28,29",
      "Июнь": "4,5,11,12,13+,18,19,25,26",
      "Июль": "2,3,9,10,16,17,23,24,30,31",
      "Август": "6,7,13,14,20,21,27,28",
      "Сентябрь": "3,4,10,11,17,18,24,25",
      "Октябрь": "1,2,8,9,15,16,22,23,29,30",
      "Ноябрь": "3*,4,5,6,12,13,19,20,26,27",
      "Декабрь": "3,4,10,11,17,18,24,25,31",
      "Всего рабочих дней": 249,
      "Всего праздничных и выходных дней": 116,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1989,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1789.8,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1192.2
    },
    {
      "Год/Месяц": 2023,
      "Январь": "1,2,3,4,5,6,7,8,14,15,21,22,28,29",
      "Февраль": "4,5,11,12,18,19,22*,23,25,26",
      "Март": "4,5,7*,8,11,12,18,19,25,26",
      "Апрель": "1,2,8,9,15,16,22,23,29,30",
      "Май": "1,6,7,8*,9,13,14,20,21,27,28",
      "Июнь": "3,4,10,11,12,17,18,24,25",
      "Июль": "1,2,8,9,15,16,22,23,29,30",
      "Август": "5,6,12,13,19,20,26,27",
      "Сентябрь": "2,3,9,10,16,17,23,24,30",
      "Октябрь": "1,7,8,14,15,21,22,28,29",
      "Ноябрь": "3*,4,5,6+,11,12,18,19,25,26",
      "Декабрь": "2,3,9,10,16,17,23,24,30,31",
      "Всего рабочих дней": 249,
      "Всего праздничных и выходных дней": 116,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1988,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1788.8,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1191.6
    },
    {
      "Год/Месяц": 2024,
      "Январь": "1,2,3,4,5,6,7,8,13,14,20,21,27,28",
      "Февраль": "3,4,10,11,17,18,22*,23,24,25",
      "Март": "2,3,7*,8,9,10,16,17,23,24,30,31",
      "Апрель": "6,7,13,14,20,21,27,28,30*",
      "Май": "1,4,5,8*,9,11,12,18,19,25,26",
      "Июнь": "1,2,8,9,11*,12,15,16,22,23,29,30",
      "Июль": "6,7,13,14,20,21,27,28",
      "Август": "3,4,10,11,17,18,24,25,31",
      "Сентябрь": "1,7,8,14,15,21,22,28,29",
      "Октябрь": "5,6,12,13,19,20,26,27",
      "Ноябрь": "2,3,4,9,10,16,17,23,24,30",
      "Декабрь": "1,7,8,14,15,21,22,28,29,31*",
      "Всего рабочих дней": 250,
      "Всего праздничных и выходных дней": 116,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1994,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1794,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1194
    },
    {
      "Год/Месяц": 2025,
      "Январь": "1,2,3,4,5,6,7,8,11,12,18,19,25,26",
      "Февраль": "1,2,8,9,15,16,22,23,24+",
      "Март": "1,2,7*,8,9,10+,15,16,22,23,29,30",
      "Апрель": "5,6,12,13,19,20,26,27,30*",
      "Май": "1,3,4,8*,9,10,11,17,18,24,25,31",
      "Июнь": "1,7,8,11*,12,14,15,21,22,28,29",
      "Июль": "5,6,12,13,19,20,26,27",
      "Август": "2,3,9,10,16,17,23,24,30,31",
      "Сентябрь": "6,7,13,14,20,21,27,28",
      "Октябрь": "4,5,11,12,18,19,25,26",
      "Ноябрь": "1,2,3*,4,8,9,15,16,22,23,29,30",
      "Декабрь": "6,7,13,14,20,21,27,28,31*",
      "Всего рабочих дней": 249,
      "Всего праздничных и выходных дней": 116,
      "Количество рабочих часов при 40-часовой рабочей неделе": 1986,
      "Количество рабочих часов при 36-часовой рабочей неделе": 1786.8,
      "Количество рабочих часов при 24-часовой рабочей неделе": 1189.2
    }
  ];

  var dates = [];

  for (var i=0;i<holidays.length;i++) {

    var obj = holidays[i];



    var counter = 0;

    var year;

    for (var key in obj) {



      if (counter === 0) {

        year = obj[key];

      } else if (counter <= 12) {

        var month = counter;

        var days = obj[key].split(',');

        for (var ii = 0;ii<days.length;ii++) {

          if (days[ii].indexOf('*') > 0) {continue}

          dates.push([year, month, parseInt(days[ii])]);

        }

      }


      counter++;

    }

  }


  return dates;

}

